In [1]:
import os 
%pwd

'd:\\End-to-End-Projects\\Marketing-Campaign-Project\\notebooks'

In [5]:
os.chdir("../")
%pwd

'd:\\End-to-End-Projects\\Marketing-Campaign-Project'

In [7]:
import pandas as pd 

df = pd.read_csv("artifacts/data_ingestion/campaign_responses.csv")

df.head()

,customer_id,age,gender,annual_income,credit_score,employed,marital_status,no_of_children,responded
0,1,35,Male,65000,720,Yes,Married,2,Yes
1,2,28,Female,45000,680,No,Single,0,No
2,3,42,Male,85000,750,Yes,Married,3,Yes
3,4,31,Female,55000,710,Yes,Single,1,No
4,5,47,Male,95000,790,Yes,Married,2,Yes